Stock-App/app/controllers/stocks_controller.rb

  def index
    @stocks = Stock.all
---
SELECT "stocks".* FROM "stocks"

  def create
    @stock = Stock.new(stock_params)

    respond_to do |format|
      if @stock.save
---
INSERT INTO "stocks" ("ticker", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ticker", "aapl"], ["user_id", 1], ["created_at", "2019-06-21 09:30:05.986509"], ["updated_at", "2019-06-21 09:30:05.986509"]]

  def destroy
    @stock.destroy
---
DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 1]]

  def correct_user
    @ticker = current_user.stocks.find_by(id: params[:id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_stock
      @stock = Stock.find(params[:id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]